/****************************************/
SDK :standard Developer Tools
ADK ：Android Developer Tools
/****************************************/
adb devices 列出所有的连接设备
reset adb 重启adb的调试桥
adb kill-server 杀死adb调试桥
adb start-server 启动adb调试桥
netstart -ano 查看端口号

/****************************************/
Android工程目录：
assets：资产目录，存放一些文件，这些文件会打包到应用程序的apk中
bin：编译后的文件目录
gen：自动生成的文件目录
project.properties 代表编译的版本,对应的Android.jar的版本
lib：新功能支持低版本的jar包
res：资源目录
--drawable:自动生成资源id	
--layout：布局
activity-main.xml 中
Android-text="@string/hello"
	"@"代表R文件
	"strng"：内部类，对应res/values/strings.xml文件
	"hello":string.xml中的字符串

/****************************************/

/****************************************/

/****************************************/

/****************************************/

/****************************************/

/****************************************/

/****************************************/

/****************************************/

/****************************************/

/****************************************/

/****************************************/

